'''
Задача 16: Требуется вычислить, сколько раз встречается некоторое число X в массиве A[1..N]. 
Пользователь в первой строке вводит натуральное число N – количество элементов в массиве. 
В последующих  строках записаны N целых чисел Ai. Последняя строка содержит число X

*Пример:*

5
    1 2 3 4 5
    3
    -> 1
'''
import random


array = []
sick = 0
count = 0
for i in range(int(input('Введите размер массива: '))) :
    sick += 1
    array.append(random.randint(1,sick))
print(array)

searchValue = int(input("Введите проверяемую цифру: "))
for j in array :
    if j == searchValue :
        count += 1
print(f"Количество повторяющихся искомых цифр - {count}")
